
Console.WriteLine("Hello, World!");

//Для Начала вспомним базовый материал на примере задачи: 
//Создать класс реализующий простое дерево сфункциями добавления и пойска