
using ForStady;

Console.WriteLine("Hello, World!");

//Для Начала вспомним базовый материал на примере задачи: 
//Создать класс реализующий простое дерево сфункциями добавления и пойска
//Усложним и поставим задачу более конкретно: 
//Реализовать красно-черное дерево.

//var tree = new RedBlackTree<int>();
//tree.Insert(10);
//tree.Insert(20);
//tree.Insert(30);
//tree.Insert(15);
//tree.Insert(25);

//Console.WriteLine("In-order traversal:");
//foreach (var item in tree.InOrderTraversal())
//{
//    Console.WriteLine(item);
//}

//Console.WriteLine("Contains 15: " + tree.Contains(15));
//Console.WriteLine("Contains 99: " + tree.Contains(99));